Autodesk.Revit.DB.IForgeSchemaServerProxy.GetAccountDetails(Autodesk.Revit.DB.ForgeTypeId)
Returns details about the account that owns the given parameter schema identifier.

Autodesk.Revit.DB.IForgeSchemaServerProxy.GetBindings(Autodesk.Revit.DB.ForgeTypeId)
Returns the category bindings, group bindings, and visibility assigned to the given parameter schema.

Autodesk.Revit.DB.IForgeSchemaServerProxy.GetSchema(Autodesk.Revit.DB.ForgeTypeId)
Returns the requested schema as a JSON string.